<b><u>Day 3 Topics:

1. Sorting DataFrames (by values and index)  
2. Filtering with multiple conditions  
3. Resetting and setting index  
4. GroupBy basics  
5. Aggregation functions  
6. Applying functions with apply()  
7. Mapping and replacing values  
8. Handling duplicates  
9. Concatenation and merging DataFrames  
10. Pivot tables basics

Questions based on topics

1. Sort this DataFrame by column 'Age' in ascending order:  
   python
   df = pd.DataFrame({"Name": ["Alice", "Bob", "Charlie"], "Age": [25, 30, 20]})
   

2. Select rows where Age > 20 and Name starts with 'A'.

3. Reset the index of the above DataFrame.

4. Set 'Name' column as the index.

5. Group the DataFrame by 'Age' and find the count of each group.

6. Use apply() to add 10 years to each age.

7. Replace 'Bob' with 'Robert' in the 'Name' column.

8. Remove duplicate rows from this DataFrame:  
   python
   df = pd.DataFrame({"Name": ["Alice", "Bob", "Alice"], "Age": [25, 30, 25]})
   

9. Concatenate two DataFrames vertically.

10. Create a pivot table from this DataFrame:  
    ```python
    data = {"Name": ["Alice", "Bob", "Alice", "Bob"],
            "Subject": ["Math", "Math", "Science", "Science"],
            "Score": [85, 90, 95, 80]}
    df = pd.DataFrame(data)
    ```
    
</b></u>

In [68]:
import pandas as pd
#1.  Sort this DataFrame by column 'Age' in ascending order:
#    python df = pd.DataFrame({"Name": ["Alice", "Bob", "Charlie"], "Age": [25, 30, 20]})

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
                   "Age": [25, 30, 20]
})

sort = df.sort_values("Age", ascending= True)
print(sort)

      Name  Age
2  Charlie   20
0    Alice   25
1      Bob   30

In [69]:
# ➤ Q2: Sort the DataFrame by 'Name' in descending order.  
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
                   "Age": [25, 30, 20]
})

sort = df.sort_values("Name", ascending = False)
print(sort)

      Name  Age
2  Charlie   20
1      Bob   30
0    Alice   25

In [70]:
# ➤ Q3:Select rows where Age > 20 and Name starts with 'A'.
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie","Sahil", "Anurag", "Pawan", "Aditi"],
     "Age": [25, 30, 20,48,65,26,19]
})

sort =df[(df["Age"]> 20) & (df["Name"].str.startswith("A"))]
print(sort)

     Name  Age
0   Alice   25
4  Anurag   65

In [71]:
# ➤ Q4:Reset the index of the above DataFrame.
import numpy as np
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie","Sahil", "Anurag", "Pawan", "Aditi"],
     "Age": [25, 30, 20,48,65,26,19]
})

df.reset_index(drop = True, inplace = True)
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   20
3    Sahil   48
4   Anurag   65
5    Pawan   26
6    Aditi   19

In [72]:
# ➤ Q5:Set 'Name' column as the index.
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie","Sahil", "Anurag", "Pawan", "Aditi"],
     "Age": [25, 30, 20,48,65,26,19],
    "Salary" : [10000,20000,30000,40000,50000,60000,70000]
})

df.set_index("Name", inplace = True)
print(df)

         Age  Salary
Name
Alice     25   10000
Bob       30   20000
Charlie   20   30000
Sahil     48   40000
Anurag    65   50000
Pawan     26   60000
Aditi     19   70000

In [73]:
# ➤ Q6:Group the DataFrame by 'Age' and find the count of each group.

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie","Sahil", "Anurag", "Pawan", "Aditi"],
     "Age": [25, 30, 20,25, 30,26,19],
    "Salary" : [10000,20000,30000,40000,50000,60000,70000]
})

group = df.groupby("Age").count()
print(group)
group = df.groupby("Age")["Name"].count()
print(group)

     Name  Salary
Age
19      1       1
20      1       1
25      2       2
26      1       1
30      2       2
Age
19    1
20    1
25    2
26    1
30    2
Name: Name, dtype: int64

In [74]:
# ➤ Q7:Use apply() to add 10 years to each age.

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie","Sahil", "Anurag", "Pawan", "Aditi"],
     "Age": [25, 30, 20,25, 30,26,19],
    "Salary" : [10000,20000,30000,40000,50000,60000,70000]
})

df["Age"] += 10
df

      Name  Age  Salary
0    Alice   35   10000
1      Bob   40   20000
2  Charlie   30   30000
3    Sahil   35   40000
4   Anurag   40   50000
5    Pawan   36   60000
6    Aditi   29   70000

In [75]:
# ➤ Q8:Replace 'Bob' with 'Robert' in the 'Name' column.

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie","Sahil", "Anurag", "Pawan", "Aditi"],
     "Age": [25, 30, 20,25, 30,26,19],
    "Salary" : [10000,20000,30000,40000,50000,60000,70000]
}) 

df.loc[1, "Name"] = "Robert"
df

      Name  Age  Salary
0    Alice   25   10000
1   Robert   30   20000
2  Charlie   20   30000
3    Sahil   25   40000
4   Anurag   30   50000
5    Pawan   26   60000
6    Aditi   19   70000

In [76]:
# 9. Concatenate two DataFrames vertically.

df1 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
     "Age": [25, 30, 20],
    "Salary" : [10000,20000,30000]
}) 

df2 = pd.DataFrame({
    "Name": ["Sahil", "Anurag", "Pawan", "Aditi"],
     "Age": [25, 30,26,19],
    "Salary" : [40000,50000,60000,70000]
}) 

concatination = pd.concat([df1,df2], axis =0, ignore_index = True )
print(concatination)

      Name  Age  Salary
0    Alice   25   10000
1      Bob   30   20000
2  Charlie   20   30000
3    Sahil   25   40000
4   Anurag   30   50000
5    Pawan   26   60000
6    Aditi   19   70000

In [77]:
# 10. Create a pivot table from this DataFrame:  
#     ```python
data = {"Name": ["Alice", "Bob", "Alice", "Bob"],
        "Subject": ["Math", "Math", "Science", "Geography"],
        "Score": [85, 90, 95, 80]}
df = pd.DataFrame(data)

table1 = pd.pivot_table(df, index = ["Name", "Subject", "Score"])
print(f"table1 Format:\n{table1}\n")

table2 = pd.pivot_table(df,index = "Name", columns = "Subject", values = "Score")
print(f"\ntable2 Format:\n{table2}")

table1 Format:
Empty DataFrame
Columns: []
Index: [(Alice, Math, 85), (Alice, Science, 95), (Bob, Geography, 80), (Bob, Math, 90)]


table2 Format:
Subject  Geography  Math  Science
Name
Alice          NaN  85.0     95.0
Bob           80.0  90.0      NaN